import streamlit as st
from PIL import Image


st.set_page_config(
    page_title='Multipage App',
    page_icon='Hi'
)


st.title("Main page")

st.sidebar.success("Select page above")

if "my_input" not in st.session_state:
    st.session_state['my_input'] = ''
new_title = '<p style="font-family:sans-serif; color:Black; font-size: 26px;">จุดมุ่งหมาย</p>'
st.markdown(new_title, unsafe_allow_html=True)
st.write("เพื่อยกระดับวงการเกษตรกรด้วยการเก็บค่าต่างๆที่ส่งผลต่อการเก็บ Carbon Credit เพื่อให้ง่ายต่อการคำนวณค่า Carbon Credit และยังมีการให้ความรู้ใหม่ๆกับทุกๆคนและเป็นความรู้ที่น่าเชื่อถือได้ผ่าน Chat Bot รวมถึงการประเมินผลผลิตภายในไร่ของเกษตรกร การใช้Carbon Credit และ รายได้ของอ้อยโดยประมาณ")

new_title = '<p style="font-family:sans-serif; color:Black; font-size: 26px;">Carbon Credit คืออะไร</p>'
st.markdown(new_title, unsafe_allow_html=True)
st.write("คาร์บอนเครดิต หมายถึง สิทธิที่เกิดจากการลดปริมาณการปล่อยก๊าซคาร์บอนไดออกไซด์ หรือก๊าซเรือนกระจกสู่สิ่งแวดล้อม อันเนื่องมาจากการที่บุคคลหรือองค์กรได้ดำเนินโครงการหรือมาตรการที่มีเป้าหมาย เพื่อลดการปล่อยก๊าซคาร์บอนไดออกไซด์ หรือก๊าซเรือนกระจกสู่สิ่งแวดล้อม ซึ่งสิทธิดังกล่าวนี้สามารถวัดปริมาณและสามารถนำไปซื้อขายในตลาดซื้อขายคาร์บอนเครดิตได้ หากจะให้เข้าใจง่ายๆ ก็คือ ก๊าซต่างๆ ที่ทำให้ปฏิกิริยาเรือนกระจก (จำนวนคาร์บอน) ที่แต่ละองค์กรสามารถลดได้ต่อปี และหากปล่อยคาร์บอนน้อยกว่าเกณฑ์จะถูกตีราคาเป็นเงิน ก่อนจะถูกขายเป็นเครดิตให้กับองค์กรอื่นได้")
image = Image.open('/Users/suchanatratanarueangrong/Mitrphol/streamlit/1663901000170.jpg')
st.image(image, caption='Carbon Credit')

new_title = '<p style="font-family:sans-serif; color:Black; font-size: 26px;">Carbon Offset คืออะไร</p>'
st.markdown(new_title, unsafe_allow_html=True)
st.write("การปล่อยก๊าซเรือนกระจก (Greenhouse Gases: GHGs) จากกิจกรรมต่าง ๆ ของมนุษย์อย่างต่อเนื่อง ทั้งการใช้พลังงาน การเกษตรกรรม การพัฒนาและการขยายตัวของภาคอุตสาหกรรม การขนส่ง การตัดไม้ทำลายป่า รวมทั้งการทำลายทรัพยากรธรรมชาติและสิ่งแวดล้อมในรูปแบบอื่น ๆ ล้วนเป็นสาเหตุสำคัญของการเกิดภาวะโลกร้อน ซึ่งส่งผลกระทบต่อวิถีการดำรงชีวิตของมนุษย์ สิ่งมีชีวิต และนับวันปัญหาดังกล่าวก็ยิ่งทวีความรุนแรงมากขึ้น การส่งเสริมและพัฒนาตลาดคาร์บอนเป็นแนวทางหนึ่งที่จะช่วยให้เกิดการลดการปล่อยก๊าซเรือนกระจกภายในประเทศ โดยใช้มาตรการทางการตลาดเป็นแรงจูงใจ ซึ่งปัจจุบันองค์กรจากภาครัฐ และภาคเอกชนต่างให้ความสนใจในการมุ่งสู่การเป็นองค์กรคาร์บอนต่ำ (Low-carbon organization) หรือ ผลิตผลิตภัณฑ์ที่มีค่าคาร์บอนฟุตพริ้นท์ต่ำ โดยหนทางหนึ่งที่เป็นการมุ่งสู่เป้าหมายดังกล่าว สามารถทำได้โดยการซื้อคาร์บอนเครดิตมาชดเชยปริมาณก๊าซเรือนกระจกที่ปล่อยออกมาจากกิจกรรมต่าง ๆ ขององค์กร หรือ ผลิตภัณฑ์ หรือที่เรียกว่า การทำกิจกรรมชดเชยการปล่อยก๊าซเรือนกระจก หรือ กิจกรรมชดเชยคาร์บอน (Carbon Offsetting) เพื่อทำให้การปล่อยก๊าซเรือนกระจกจากองค์กร หรือ ผลิตภัณฑ์นับได้เท่ากับศูนย์ หรือ ที่เรียกว่า Carbon Neutral")
image = Image.open('/Users/suchanatratanarueangrong/Mitrphol/streamlit/Offset.jpg')
st.image(image, caption='Carbon Credit')

new_title = '<p style="font-family:sans-serif; color:Black; font-size: 26px;">Carbon Credit จะเพิ่มรายได้ได้ยังไง</p>'
st.markdown(new_title, unsafe_allow_html=True)
st.write("การที่องค์กรนึงสามารถประหยัดการใช้ค่า Carbon Credit ได้มากเท่าไหร่ก็จะสามารถนำ Carbon Credit ไปขายให้องค์กรอื่นเพื่อเพิ่มรายได้ของบริษัทตัวเองได้ และคนในองค์กรก็จะได้รับผลประโยชน์และมีโอกาสจะได้รายได้มากขึ้นด้วย ซึ่งถ้ายกตัวอย่างแบบมิตรผลหากชาวไร่สามารถเก็บค่า Carbon Credit ได้มากทางมิตรผลจะนำเครดิตเหล่านั้นไปขายและนำรายได้กลับคืนสู่ชาวไร่เพื่อส่งเสริมอาชีพเกษตรกรรวมถึงเป็นแรงจูงใจในการชวนคนรุ่นใหม่เข้ามาวงการเกษตรได้มากขึ้น ทั้งนี้ประเทศไทยเป็นประเทศแห่งการเกษตรดังนั้นการพัฒนาวงการการเกษตรก็จะสามารถยกระดับประเทศไทยได้ทั้งประเทศ")
image = Image.open('/Users/suchanatratanarueangrong/Mitrphol/streamlit/messageImage_1697012143607.jpg')
st.image(image, caption='Carbon Credit')